
#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");
	
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Данные.ДействуетНаОсновании) Тогда
		 
 		СтандартнаяОбработка = Ложь;	
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);

	КонецЕсли;		 
	
КонецПроцедуры
#КонецОбласти
